{"1000": "Are there any lessons that we can learn from history that you think are super-important?", "1001": "Are you a \"cup is half full\" or \"cup is half empty\" kind of person?", "1002": "Are you a cat person or a dog person? Why?", "1003": "Are you a part of any clubs at school? Which ones?", "1004": "Are you a kind of person who will tell your families or friends when you are upset?", "1005": "Are you closer to your mom or dad?", "1006": "Are you closer to your siblings or your friends? Why do you think that is?", "1007": "Are you more of an indoor person or an outdoor person?", "1008": "Are you popular in school? Why or why not? Would you like to be?", "1009": "At what age would you like to live on your own?", "1010": "Can you list the most important rules in our family? What are they?", "1011": "Can you teach me something you learned at school?", "1012": "Can you teach me something you learned from your friends?", "1013": "Describe something silly that happened to someone else or yourself.", "1014": "Did anything make you think hard today?", "1015": "Did anything you learned today surprise you?", "1016": "Did you have a chance to be kind to anyone today?", "1017": "Did you help anyone today?", "1018": "Do you admire the hero in this movie/book? Why or why not?", "1019": "Do you believe in ghosts?", "1020": "Do you believe in aliens?", "1021": "Do you care about what other people think about you?", "1022": "Do you collect anything? What is it?", "1023": "Do you ever feel lonely or left out?", "1024": "Do you ever feel sad? What do you do to feel comforted?", "1025": "Do you ever wish you could go back in time and be a little kid again?", "1026": "Do you get along with your siblings?", "1027": "Do you have a bucket list? What are the top two or three things on that list?", "1028": "Do you have a pet? What kind of animal is it?", "1029": "Do you have any dark secrets?", "1030": "Do you have any exciting stories to tell?", "1031": "Do you have any friends that youre worried about right now? Why?", "1032": "Do you have any idea of a great invention?", "1033": "Do you have any recurring nightmares?", "1034": "Do you have any role models? Who are they, and why do you look up to them?", "1035": "Do you have anyone at school or among your friends who you admire right now?", "1036": "Do you have better or worse relationships with your sibling(s) than your friends?", "1037": "Do you have chores at home? What are they?", "1038": "Do you have choses at home? What would you choose to do first? Why?", "1039": "Do you have friends who are different races or religions than you? Does that have any effect on the friendship?", "1040": "Do you have siblings? Where are you in the birth order?", "1041": "Do you know something that you think no one else knows?", "1042": "Do you know what EQ (emotional intelligence quotient) is? If someone has a high EQ, what are they like?", "1043": "Do you like going to school?", "1044": "Do you like reading books? Whats the last book you read?", "1045": "Do you like to go out to eat?", "1046": "Do you like to keep your room neat and organized, or do you like it to be messy?", "1047": "Do you like your name? Why or why not?", "1048": "If you can give yourself a new name, what will you pick?", "1049": "Do you live by any life motto?", "1050": "Do you plan to prioritize a career or family when you finish college/school? Do you think its possible to balance both?", "1051": "Do you play a musical instrument? What instrument?", "1052": "Do you play any musical instruments? Which one?", "1053": "Do you play any sports? Which ones?", "1054": "Do you play any video games? Which ones?", "1055": "Do you prefer to spend your time indoors or outdoors?", "1056": "Do you pretend to be someone? Who? Why?", "1057": "Do you respect your teachers? Why or why not? Do you think they respect you?", "1058": "Do you speak any other languages? Which ones?", "1059": "Do you tend to have just one or two good friends, or do you have a large group of friends?", "1060": "Do you think aliens exist?", "1061": "Do you think it is ever okay to share a secret that you were told in confidence? When and why?", "1062": "Do you think it is okay for people to cry when they get upset? (male and female, young and old?)", "1063": "Do you think its important to save for a rainy day?", "1064": "Do you think its ok to have secrets in relationships?", "1065": "Do you think it's a good idea to work for a while after high school before making up your mind about a long-term career?", "1066": "Do you think it's important to get physical education in school? Why or why not?", "1067": "Do you think kids from private schools have an unfair advantage?", "1068": "Do you think of yourself as brave? When you're scared, what do you do?", "1069": "Do you think some people are more susceptible to peer pressure than others? Why do you think that is?", "1070": "Do you think that everyone should go to college after high school? Why or why not?", "1071": "Do you think there is a difference between being smart and being wise?", "1072": "Do you think there is a such thing as peer pressure? Do you ever feel peer pressure?", "1073": "Do you think you are addicted to your phone? Do you think we have appropriate rules around phones in our family?", "1074": "Do you think you can learn anything, with enough practice?", "1075": "Do you think you could go an entire day without talking?", "1076": "Do you think you might like to get married someday?", "1077": "Do you think you should be paid for specific chores? Which ones? And how much do you think each is worth?", "1078": "Do you think you will be close to your siblings when you grow up?", "1079": "Do you think your friends talk to their parents?", "1080": "Do you think your parents ever lie?", "1081": "Do you think you're good at making friends?", "1082": "Do you want to be famous?", "1083": "Do you want to have kids when you grow up? Why or why not?", "1084": "Does it matter if a person makes a moral or immoral choice, if no one ever knows?", "1085": "Have I never not noticed when you're sad?", "1086": "Have you ever been mad at one of your friends? How did you handle it?", "1087": "Have you ever had an imaginary friend? Tell me about him.", "1088": "Have you ever lost something you really liked? What did you do?", "1089": "Have you ever thought of hurting yourself? What did you do?", "1090": "Have you ever wanted to be popular?", "1091": "Have you ever wished you were dead? When and why?", "1092": "How are you like each of your parents? How are you different?", "1093": "How can teenagers contribute to improving their community?", "1094": "How can we tell that you are happy? What do you do?", "1095": "How did you grow your mind today?", "1096": "How do different emotions feel in your body?", "1097": "How do you deal with stress?", "1098": "How do you feel when someone is angry with you? How do you act?", "1099": "How do you feel when you apologize, before, during and after?", "1100": "How do you like to spend your free time?", "1101": "How do you make friends?", "1102": "How do you make other people smile?", "1103": "How do you manage your homework so you can stay on top of it and feel good about it?", "1104": "How do you pass time when youre waiting for someone?", "1105": "How do you see me handle big emotions?", "1106": "How do you think our/your family is the same or different from other families?", "1107": "How do you think your friends' families compare to ours? Are they about as close? Closer? More distant? Why do you think that?", "1108": "How do you think your relationship with your family will change after you finish high school?", "1109": "How do you work things out with a friend when you have a disagreement?", "1110": "How high can you count?", "1111": "How important is money? Do you think there is enough money in the world for everyone to have enough?", "1112": "How many animal noises can you make?", "1113": "How many hugs do you need every day?", "1114": "How many of your ancestors can you name and what do you know about them?", "1115": "How often do you fart?", "1116": "How old are you?", "1117": "How old do you think I am?", "1118": "How will you maintain relationships with your best friends once you aren't seeing them in school every day?", "1119": "How would describe your perfect day?", "1120": "How would you change the world if you could?", "1121": "How would you describe the role social media plays in your relationships with friends that you spend time with in real life?", "1122": "How would you describe yourself to someone who hasnt met you?", "1123": "If I asked your best friend to describe you, what would they say?", "1124": "If it were up to you, how would you change the world?", "1125": "If someone gave you $1,000 and said you had to give it to charity, which charity would you choose and why?", "1126": "If time travel was possible, would you rather go to the past or the future?", "1127": "If we could go anywhere you wanted on vacation, where would you choose? Why?", "1128": "If we were at the grocery store, what would you like to buy?", "1129": "If you could ask anyone for help, who would it be and why?", "1130": "If you could be a cartoon character, who would you be?", "1131": "If you could be any age, what age would you want to be and why?", "1132": "If you could be any animal what would you be and why?", "1133": "If you could be any animal, which one would you be?", "1134": "If you could be any pizza which one would you be?", "1135": "If you could be any vegetable, what would you be?", "1136": "If you could be anywhere right now where would you be? What would you be doing?", "1137": "If you could change one thing about each of your parents, what would it be?", "1138": "If you could change one thing about your appearance, what would it be?", "1139": "If you could change one thing about yourself, what would it be and why?", "1140": "If you could do anything right now, what would you do?", "1141": "If you could eat only one food for the rest of your life, what would it be?", "1142": "If you could go anywhere in the world, where would you go and why?", "1143": "If you could go anywhere, where would you go?", "1144": "If you could go back in time and give your younger self advice, what would you tell yourself?", "1145": "If you could go forward in time and give your older self advice, what would you tell yourself?", "1146": "If you could have a conversation with anyone in history, who would it be?", "1147": "If you could have an unlimited supply of any food for the rest of your life, what would it be and why?", "1148": "If you could have any animal for a pet which one would you choose?", "1149": "If you could have any super power, what would it be and why?", "1150": "If you could have any superpower, which one would you choose and why?", "1151": "If you could instantly become an expert in something, what would it be?", "1152": "If you could live anywhere in the world, where would you live?", "1153": "If you could live as another person for a day, who would you pick and why?", "1154": "If you could live with one cartoon character, who would you choose and why?", "1155": "If you could make three wishes, what would they be?", "1156": "If you could marry any celebrity, who would it be?", "1157": "If you could only keep one book which one would you keep? Why?", "1158": "If you could only keep one toy which one would you keep? Why?", "1159": "If you could paint the world with only one color, what would it be?", "1160": "If you could play any instrument, which would you choose and why?", "1161": "If you could re-name yourself, what would you like to be called? Why?", "1162": "If you could take only five things with you to a deserted island, what would they be?", "1163": "If you could trade lives for one day with somebody you know, who would it be?", "1164": "If you could watch only one movie for the rest of your life, what would it be and why?", "1165": "If you had a say in how the country's government operates, what changes would you like to see?", "1166": "If you had a say in how your school operates, what changes would you like to see?", "1167": "If you had a time machine for a day, what would you do with it?", "1168": "If you had to choose only three words to describe yourself, what would you say?", "1169": "If you had to pick just one cause to fight for, which one would it be?", "1170": "If you had a lot of money, how would you spend it?", "1171": "If you opened a store, what would you sell?", "1172": "If you suddenly became invisible, whats the first thing you would do?", "1173": "If you suddenly gained the power to read minds, whose mind would you want to read and why?", "1174": "If you were a candy bar, what candy bar would you be?", "1175": "If you were a superhero, what would your superhero name be?", "1176": "If you were given the chance to become immortal, would you take it? Why or why not?", "1177": "If you were in a parade, who would you like to be?", "1178": "If you were invisible for a day, what would you do?", "1179": "If you were made a teacher for a day, which subject would you want to teach?", "1180": "If you were stranded on a desert island, which one possession would you want to have with you?", "1181": "If you won the lottery, what would you do with the money?", "1182": "If your best friend could be anyone from a book you have read, who would it be?", "1183": "If your life had a theme song, what would it be and why?", "1184": "If your pets could talk, what would they say to you?", "1185": "In a zombie apocalypse, who would you want on your team and why?", "1186": "In case of a zombie apocalypse, where will you hide?", "1187": "Is being a millionaire a worthwhile goal?", "1188": "Is it ever ok to cheat, in academics, sports, business?", "1189": "Is it ever okay to lie?", "1190": "Is it ever okay to treat people worse because they look different than you do?", "1191": "Is it hard to make the choice to be kind sometimes?", "1192": "Is it important to vote? Why?", "1193": "Is the discipline in our family fair?", "1194": "Is there anyone at school that you would like to get to know better? Who is it?", "1195": "Is there anything about you that inspires other people in any way?", "1196": "Is there anything youre worried about right now?", "1197": "Is there someone who you think looks up to you? Who is it, and what do you think they look up to about you?", "1198": "Is there something you enjoy that I dont know about?", "1199": "Name five reasons youre glad to be alive.", "1200": "Name someone you trust. Why?", "1201": "On a scale of 1 to 10, how strict are the parents in our family? What is the ideal number?", "1202": "On a scale of 1 to 10, how would you rate your day today?", "1203": "Out of all of the Halloween costumes you have worn, which is your favorite? Why?", "1204": "Out of your accomplishments, which ones make your family members the proudest? Why?", "1205": "Tell each person in the family why youre glad theyre part of the family.", "1206": "Tell me about the best and worst parts of your day.", "1207": "Tell me about your favorite movie or TV show.", "1208": "Tell us a memory of something you did with your family.", "1209": "Tell us of a time that you were silly.", "1210": "Was anyone kind to you today?", "1211": "What advice would you give to younger students regarding how to make the most of primary/high school?", "1212": "What advice would you like to give to adults about how to make the world a better place by the time you are an adult?", "1213": "What are the different kinds of courage? How do you define bravery?", "1214": "What are the good things about having siblings? What are the bad things?", "1215": "What are the most important things your parents have taught you?", "1216": "What are the most important traits for a friend to have?", "1217": "What are the qualities that make a good friend?", "1218": "What are the three most interesting things about you?", "1219": "What are three things that you are grateful for today or this week?", "1220": "What are you most proud of?", "1221": "What are you scared of the most?", "1222": "What are you thinking about right now?", "1223": "What are your favorite hobbies? What do you enjoy about them?", "1224": "What are your favorite things to do when spending time with friends?", "1225": "What are your hobbies?", "1226": "What are your plans for the future?", "1227": "What are your three favorite games to play? What do you like about them?", "1228": "What book did you most like for an adult to read to you when you were little? What did you like about it?", "1229": "What bugs you?", "1230": "What color is the happiest color? What makes it happy?", "1231": "What could our family do that would make the world a better place?", "1232": "What country do you think has the best government?", "1233": "What did you do today to help our family or make our family life better?", "1234": "What did you eat for lunch yesterday?", "1235": "What did you learn today outside of school?", "1236": "What do your parent do when you do something against our rules?", "1237": "What do you do during recess time?", "1238": "What do you do if you see someone treated unfairly?", "1239": "What do you do to cheer yourself up when you feel down?", "1240": "What do you do when people stare at you?", "1241": "What do you do when you feel so frustrated or hopeless that you want to give up?", "1242": "What do you do when youre afraid?", "1243": "What do you do when youre bored?", "1244": "What do you enjoy doing with your family?", "1245": "What do you feel that your/our generation can do to have a meaningful, positive impact on the environment?", "1246": "What do you know how to do, that you could teach someone else?", "1247": "What do you like best about each of your siblings?", "1248": "What do you like best about school?", "1249": "What do you like most about Saturdays?", "1250": "What do you like the best about your favorite teacher? Why?", "1251": "What do you like the most about your family?", "1252": "What do you like to daydream about?", "1253": "What do you like to do for fun?", "1254": "What do you like to do most during the weekends?", "1255": "What do you like to spend your allowance on?", "1256": "What do you personally do to make sure that you are a good friend to the people who are important to you?", "1257": "What do you plan to do after you graduate from school?", "1258": "What do you see as the most important social issues in the world today?", "1259": "What do you think about cryptocurrency? Should it be regulated?", "1260": "What do you think about home-schooling?", "1261": "What do you think about taxes? Is it a good idea that everyone chips in to pay for schools and libraries and parks and roads?", "1262": "What do you think are the most important qualities of a good parent?", "1263": "What do you think cars will be like ten years from now?", "1264": "What do you think happens after death?", "1265": "What do you think is beyond the stars?", "1266": "What do you think is the meaning of life?", "1267": "What do you think leadership is? What makes a good leader?", "1268": "What do you think makes a family close?", "1269": "What do you think makes a happy family?", "1270": "What do you think makes a person popular?", "1271": "What do you think the \"take-away\" message of this movie/book is?", "1272": "What do you think the biggest problem in our country is?", "1273": "What do you think the biggest problem in the world is?", "1274": "What do you think the biggest problem in your school is?", "1275": "What do you think the purpose is of the various emotions?", "1276": "What do you think the world will be like 25 years from now?", "1277": "What do you think we should be doing to care for the planet?", "1278": "What do you think will be the most challenging parts of adjusting to life after high school?", "1279": "What do you think would help decrease homelessness?", "1280": "What do you think you can you do to change the world?", "1281": "What do you think you'll miss the most about being in school after you graduate from high school? Why?", "1282": "What do you think your life would look like 10 years from now?", "1283": "What do you usually buy with your allowance money?", "1284": "What do you usually do after school?", "1285": "What do you usually do during the weekends?", "1286": "What do you usually eat for lunch at school?", "1287": "What do you want to be when you grow up? Why?", "1288": "What do you wish your parents' generation had done differently? Why?", "1289": "What do you worry about the most?", "1290": "What does it mean to be a good citizen?", "1291": "What excites you the most about what comes after high school? What do you find to be the most stressful about it?", "1292": "What experience have you had with bullying during your time in school?", "1293": "What helps you feel better when youre upset or stressed out?", "1294": "What hurts your feelings? How do you act when your feelings are hurt?", "1295": "What if someone offered you a million dollars to create a piece of art of your choosing? What would it look like?", "1296": "What if you could have any vehicle that you want, no matter how much it costs? What would you choose? Why?", "1297": "What if you could live anywhere on Earth? Where would you go? What appeals to you about that location?", "1298": "What if you could live in a fantasy world from a book or movie? Which one would you choose? Why?", "1299": "What if you could really live on another planet? Which planet would you choose and why?", "1300": "What if you could travel back in time to meet any historical figure you want? Who would it be? What would you ask them?", "1301": "What if you got to design and build a house for your family to live in? Describe what it would be like.", "1302": "What if you had no choice but to give up internet access? What would change in your daily routine?", "1303": "What if you had the ability to choose the curriculum for your grade in school? What subjects would you choose and why?", "1304": "What if you were in charge of writing a school theme song? What music genre would you choose? What would some of the words be?", "1305": "What is a quality you wish you could have more of?", "1306": "What is one of your earliest memories?", "1307": "What is one thing that you do not want to sell, for any price?", "1308": "What is one thing that you want to change about the world?", "1309": "What is one thing you dont know how to do but you wish you did?", "1310": "What is something special you want to do for a friend?", "1311": "What is something that you feel passionately about in life?", "1312": "What is something that you like to do when you're bored?", "1313": "What is something that you really like about yourself?", "1314": "What is something you are really good at?", "1315": "What is the best conversation topic for the middle of the night?", "1316": "What is the best gift you have ever given someone? What made it special?", "1317": "What is the best part of your day?", "1318": "What is the best surprise you ever had?", "1319": "What is the best thing that ever happened to you?", "1320": "What is the best thing that has ever happened to you?", "1321": "What is the best way for me to help you when you feel grumpy?", "1322": "What is the best way to eat an Oreo?", "1323": "What is the best way to handle it when you feel super angry?", "1324": "What is the funniest thing that ever happened to you?", "1325": "What is the grossest thing you can think of?", "1326": "What is the hardest thing about school?", "1327": "What is the most adventurous thing you have ever done in your life?", "1328": "What is the most dangerous thing you have ever done?", "1329": "What is the most difficult thing in your life right now?", "1330": "What is the most embarrassing incident that has ever happened to you in your life?", "1331": "What is the most embarrassing thing that ever happened to you at school?", "1332": "What is the most important thing to do to have a good relationship with a sibling?", "1333": "What is the nicest thing someone has done for you?", "1334": "What is the prettiest thing you have ever seen?", "1335": "What is the weirdest dream youve ever had?", "1336": "What is the weirdest food you have ever eaten? Where and when did you eat it?", "1337": "What is the weirdest or craziest thing you have ever done in your life?", "1338": "What is the worst movie or TV show you have ever seen? What did you dislike about it?", "1339": "What is the worst smell in the world for you?", "1340": "What is your biggest fear?", "1341": "What is your biggest goal this year?", "1342": "What is your biggest worry in life?", "1343": "What is your dream career? Why interests you about it?", "1344": "What is your dream job?", "1345": "What is your earliest memory?", "1346": "What is your favorite after-school activity? What do you like about it?", "1347": "What is your favorite animal?", "1348": "What is your favorite book now? Why do you like it?", "1349": "What is your favorite candy?", "1350": "What is your favorite chore to do in the house? Which is your least favorite chore?", "1351": "What is your favorite chore?", "1352": "What is your favorite class in school? What do you like about it?", "1353": "What is your favorite color and why?", "1354": "What is your favorite day of the week?", "1355": "What is your favorite dessert?", "1356": "What is your favorite dinosaur?", "1357": "What is your favorite family tradition?", "1358": "What is your favorite food?", "1359": "What is your favorite ice cream flavor?", "1360": "What is your favorite item of clothing? What do you love about it?", "1361": "What is your favorite movie in existence?", "1362": "What is your favorite place in the house?", "1363": "What is your favorite restaurant?", "1364": "What is your favorite restaurant? What is your favorite thing to order?", "1365": "What is your favorite room in the house? Why?", "1366": "What is your favorite school subject?", "1367": "What is your favorite social media? What do you like about it? Do you think it has any downsides?", "1368": "What is your favorite song at the moment?", "1369": "What is your favorite thing about yourself?", "1370": "What is your favorite thing to do with a friend?", "1371": "What is your favorite time of the school day?", "1372": "What is your favorite time of the year?", "1373": "What is your idea of an ideal day?", "1374": "What is your least favorite class in school? What dont you like about it?", "1375": "What is your most embarrassing moment that you're willing to share? What did you learn from it?", "1376": "What is your most recent lie?", "1377": "What is your motto in life?", "1378": "What is your ultimate goal in life?", "1379": "What joke never fails to make you laugh?", "1380": "What kids are popular in your grade? What do you think makes a person popular?", "1381": "What kind of games do you play the most?", "1382": "What kind of parent will you be?", "1383": "What kinds of lies do your friends tell their parents?", "1384": "What kinds of movies or TV shows do you like to watch? Why?", "1385": "What made you laugh today?", "1386": "What made you smile today?", "1387": "What makes someone a bad friend?", "1388": "What makes someone a good friend?", "1389": "What makes something or someone silly?", "1390": "What makes you feel better when you're upset?", "1391": "What makes you feel good about yourself?", "1392": "What makes you really happy?", "1393": "What makes you smile?", "1394": "What makes you so awesome?", "1395": "What makes you thrilled and excited?", "1396": "What one thing that you did in the past would you like to change if you could have a do-over?", "1397": "What program or club do you wish your school had more money for?", "1398": "What scares you the most about the future?", "1399": "What scares you the most and why?", "1400": "What school rule(s) do you wish would be eliminated? Why?", "1401": "What sound annoys you the most?", "1402": "What superhero would you want to be and why?", "1403": "What talents or skills do you have?", "1404": "What thoughts do you have on how to improve school safety?", "1405": "What three words do you think best describe our family?", "1406": "What three words would you use to describe yourself?", "1407": "What traits do you look for in friends?", "1408": "What traits do you look for when finding a new friend?", "1409": "What traits do you look for when youre trying to make a new friend?", "1410": "What traits do you most admire in other people?", "1411": "What type of music do you listen to?", "1412": "What was the best holiday you ever had?", "1413": "What was the best party you ever went to? What made it fun?", "1414": "What was the first thing that made you laugh today?", "1415": "What was the last disagreement you had with your siblings about?", "1416": "What was the last thing that you bought with your own money?", "1417": "What was the most disgusting thing youve ever eaten?", "1418": "What was the nicest thing someone has ever done for you?", "1419": "What was your favorite thing of the summer?", "1420": "What was your favorite thing of the winter?", "1421": "What weird food combinations do you really enjoy?", "1422": "What will you be glad to not have to do anymore once you graduate from high school? Why?", "1423": "What word do you utter the most?", "1424": "What words do you wish someone would say to you when youre having a tough time?", "1425": "What would you do if all the other kids were planning to cheat on the final and you knew that doing so would lower your grade?", "1426": "What would you do if you had no TV?", "1427": "What would you like me to play with you?", "1428": "What would you like people to say about you after you die?", "1429": "What would you like to ask me?", "1430": "What would you like to become better at?", "1431": "What would you like to collect?", "1432": "What would you like to do more with your family?", "1433": "What would you like to learn to do?", "1434": "What would you say is one of your weaknesses?", "1435": "What would you to with a million dollars?", "1436": "What would you want to be famous for?", "1437": "What would you want to buy if money wasnt an issue?", "1438": "What would your dream house look like?", "1439": "What would your weapon of choice be if you were in a zombie apocalypse scenario?", "1440": "Whats one thing you forget to do regularly?", "1441": "Whats something that you dont like?", "1442": "Whats the best book youve ever read?", "1443": "Whats the best gift that you ever received? What made it special?", "1444": "Whats the best thing about your/our family?", "1445": "Whats the bravest thing youve ever done?", "1446": "Whats the coolest thing you have ever seen?", "1447": "Whats the coolest thing youve ever built?", "1448": "Whats the craziest thing you have ever done?", "1449": "Whats the dumbest miscommunication youve ever had with a friend?", "1450": "Whats the first that you do after you wake up?", "1451": "Whats the first thing that you remember about mom or dad (or a sibling)?", "1452": "Whats the funniest actual name youve heard of someone having?", "1453": "Whats the funniest thing you can think of right now?", "1454": "Whats the funniest word you know?", "1455": "Whats the hardest thing about being a child?", "1456": "Whats the longest walk youve ever taken?", "1457": "Whats the longest word you know?", "1458": "Whats the most annoying noise for you?", "1459": "Whats the most important thing in your life?", "1460": "Whats the silliest face that you can make?", "1461": "Whats the worst thing about being a kid?", "1462": "Whats your biggest regret in life so far?", "1463": "Whats your dream vacation?", "1464": "Whats your favorite cereal? Why?", "1465": "Whats your favorite color?", "1466": "Whats your favorite dessert?", "1467": "Whats your favorite food?", "1468": "Whats your favorite game to play?", "1469": "Whats your favorite ice cream?", "1470": "Whats your favorite joke?", "1471": "Whats your favorite movie? Why?", "1472": "Whats your favorite outfit? What do you like about it?", "1473": "Whats your favorite smell? Whats the yuckiest thing youve ever smelled?", "1474": "Whats your favorite song? Why do you like it?", "1475": "Whats your favorite store? Where is it located?", "1476": "Whats your favorite story?", "1477": "Whats your favorite thing to do in the car?", "1478": "Whats your favorite time of day? Why?", "1479": "Whats your favorite vegetable?", "1480": "Whats your favorite weather? Why do you like that weather?", "1481": "Whats your funniest face? Can you show me?", "1482": "Whats your greatest achievement so far?", "1483": "Whats your most embarrassing moment?", "1484": "Whats your opinion on gun control?", "1485": "Whats your secret talent?", "1486": "What's the best thing about being a kid?", "1487": "What's the best thing about being a teenager?", "1488": "What's the coolest thing you saw someone do this week?", "1489": "What's the difference between a good friend and a best friend?", "1490": "What's the funniest prank you have been involved with? What made it so funny?", "1491": "What's the most embarrassing thing that ever happened to you?", "1492": "What's the worst thing about being a teenager?", "1493": "What's your absolute favorite food? How do you like it to be prepared?", "1494": "What's your favorite after-school snack? Would you eat it every day if you could?", "1495": "What's your favorite outdoor activity? What do you enjoy about it?", "1496": "What's your favorite subject in school? What do you like about it?", "1497": "What's your idea of the ideal first date? Describe what it would be like.", "1498": "What's your least favorite food that most people seem to like? Why do you dislike it?", "1499": "When did you last say, I do!", "1500": "When do you feel the most proud of who you are?", "1501": "When do you like me to hug you? When does it embarrass you?", "1502": "When was the last time you cried and why?", "1503": "When was the last time you made someone cry?", "1504": "When was the last time you were silly? What did you do?", "1505": "When you are really angry at me, what is the most helpful way for me to respond?", "1506": "When you feel a strong emotion, what is the best way to respond to it?", "1507": "When you get really upset, how do you help yourself calm down?", "1508": "When you get your own apartment or dorm room, what's the first thing you plan to buy for it that you can't have now. Why would you choose this item?", "1509": "When you make a mistake, are you able to repair things so that you end up feeling ok? What is the hardest part of repairing things?", "1510": "When you wake up in a bad mood, what strategies do you use to help yourself feel better so you can have a good day?", "1511": "When you were young, did you have a favorite stuffed animal or toy?", "1512": "When you woke up this morning, what was the first thing that you thought about?", "1513": "When yourdescendants look back, what do you want them to say about you?", "1514": "When you're upset, do you like me to stay close or give you some space?", "1515": "Where did you go on your most recent vacation?", "1516": "Where do go shopping for your clothes?", "1517": "Where do you consider yourself on the shy to outgoing continuum?", "1518": "Where do you like to go in the car?", "1519": "Where do you see yourself in 5 years?", "1520": "Where is your favorite place to hang out? What do you like about it?", "1521": "Which class are you learning the least in?", "1522": "Which class are you learning the most in?", "1523": "Which is your favorite meal of the day?", "1524": "Which of your family members are you the most like? What traits do you share with those people?", "1525": "Which of your family members has had the most influence on the person you are today? How have they influenced you?", "1526": "Which possession do you cherish the most? Why?", "1527": "Who are your heroes and what qualities do you admire about them?", "1528": "Who do you love? Why?", "1529": "Who do you resemble more, your dad or your mom?", "1530": "Who do you usually sit with at lunch at school? What do you talk about?", "1531": "Who in your life do you consider a mentor? How has that person helped make you the person you are today?", "1532": "Who is or was your favorite teacher? Why?", "1533": "Who is the funniest person you know?", "1534": "Who is the meanest kid you know? Why?", "1535": "Who is the nicest person you know?", "1536": "Who is the richest person in the world? How do you know theyre rich?", "1537": "Who is your best friend and why?", "1538": "Who is your favorite actor/actress?", "1539": "Whos the funniest person you know?", "1540": "Why do you think kids put rings in their eyebrows and noses and bellybuttons?", "1541": "Would rather go to the mountains or the bottom of the sea?", "1542": "Would you cheat on a test if you knew you would not get caught? Why or why not?", "1543": "Would you consider yourself to be more of a shy person or an outgoing person?", "1544": "Would you ever be vegan? Vegetarian?", "1545": "Would you ever date someone with different religious beliefs than you? Why or why not?", "1546": "Would you ever want to be a teacher? Why or why not?", "1547": "Would you make the same choices the person in this book/movie is?", "1548": "Would you rather be alone or with friends?", "1549": "Would you rather be five years older or five years younger?", "1550": "Would you rather be five years younger or five years older?", "1551": "Would you rather burn to death or freeze to death?", "1552": "Would you rather date someone older or younger than you?", "1553": "Would you rather eat an apple or an orange?", "1554": "Would you rather eat cake or ice cream?", "1555": "Would you rather eat pizza or hotdogs for a whole year?", "1556": "Would you rather have no hearing or no sight?", "1557": "Would you rather live in a castle, on a boat, or on a cloud?", "1558": "Would you rather live on the beach or in the mountains?", "1559": "Would you rather see everything in slow motion or in fast forward?", "1560": "Would you rather time-travel into the past to meet your ancestors or into the future to meet your descendants?", "1561": "Can you name 5 fishes that live in the sea?", "1562": "Can you name 5 birds?", "1563": "Can you name 5 bugs that have wings?", "1564": "What have you learned in school that a teacher didnt teach you?", "1565": "What is the most disgusting food combo youve ever seen someone eat?", "1566": "What would your ultimate vacation look like?", "1567": "Whats the funniest thing that happened this week?", "1568": "What's your favorite hotel?", "1569": "What's your favorite beach?", "1570": "What's your favorite holiday park?", "1571": "What's your favorite mountain?", "1572": "Whats your favorite dessert?", "1573": "Who is your favorite YouTuber? What do you like about them?", "1574": "What is your favorite Youtube channel? Why?", "1575": "Youve been studying for so long! Need to take a break?", "1576": "Do you know how sometimes humans are allergic to animals? What would happen if an animal was allergic to humans?", "1577": "If you could paint your room any color, what would you choose?", "1578": "If you could time travel, what time would you choose? Why? What would you do while you were there?", "1579": "What company would you choose to be a brand ambassador for?", "1580": "What was the best food one of your friends brought for lunch at school?", "1581": "Whats your favorite comfort food?", "1582": "Which has the best soundtrackLord of the Rings, La La Land, Gladiator, or Perks of Being a Wallflower?", "1583": "Would you rather wear grandpas clothes the rest of the year or dress like Lady Gaga for a month?", "1584": "Could you eat a whole pizza all by yourself?", "1585": "If there was a story about an elephant and a zebra, what do you think it would be about?", "1586": "What do you wish we talked about more?", "1587": "What holiday do you look forward to the most?", "1588": "Whats something fun we could do together?", "1589": "Whats something unique about you?", "1590": "Whats the best dream youve ever had?", "1591": "Would you rather have 10 kids or no kids?", "1592": "Are there any new skills youd like to learn?", "1593": "How many pets will you have when you get your place?", "1594": "If squirrels could talk, do you think they would have a high voice or a deep voice?", "1595": "What food combination do you want to try?", "1596": "What makes you feel anxious?", "1597": "When do you know you can trust someone?", "1598": "Would you rather be asked to dance with someone you dont like or be turned down by someone you do like?", "1599": "If you can convince me that olives are the best topping on ice cream, Ill let you skip school one day so we can go somewhere fun.", "1600": "If you make a pizza, what topping will you choose?", "1601": "If you could have an exotic pet, what animal would you choose?", "1602": "What app should I get on my phone that I dont have yet?", "1603": "What do you think it feels like to be a sloth?", "1604": "What fruit could you eat every day for the rest of your life?", "1605": "When do you feel the most alone?", "1606": "Would you rather date someone very quiet or very loud?", "1607": "Can you name 3 red fruits?", "1608": "Do you like to have time alone or prefer to be surrounded by friends?", "1609": "Do you want to go to college? Have you thought about where you want to go and what you want to study?", "1610": "What do you want to do for your next birthday?", "1611": "What topic could you talk about for hours?", "1612": "Who is your celebrity crush?", "1613": "Who makes you laugh?", "1614": "If you could change the color of strawberries, what color would you make them?", "1615": "If you could trade lives with a character in a book, who would you choose?", "1616": "Pizza every day or chocolate every day?", "1617": "What do you like to do when youre alone?", "1618": "What makes you laugh?", "1619": "What movie can you quote all the lines from? What do you love most about that movie?", "1620": "What support do you need right now?", "1621": "Do you eat soup or drink soup?", "1622": "Flip phone or desktop computer?", "1623": "iPAD or laptop? Why?", "1624": "Windows PC or  Apple MAC? Why?", "1625": "Apple iOS or Google Android? Why?", "1626": "Is there something youve wanted to talk to me about?", "1627": "Should you dip fries in ranch dressing, ketchup, or ice cream?", "1628": "What are the best pizza toppings ever?", "1629": "What book should they make into a movie?", "1630": "What would you make that world look like if you were the leader of a post-apocalyptic world?", "1631": "Brussel sprouts with chocolate sauce or broccoli and strawberry syrup?", "1632": "If you could do whatever you wanted, what would that be?", "1633": "What is the best way to eat a hot dog?", "1634": "What is the best way to eat an Oreo?", "1635": "What movie or song does everyone love but you dont like?", "1636": "What one food could you eat every day for the rest of your life and never get sick of it?", "1637": "Which do you prefer, texting or phone calls? Is there anyone you make an exception for?", "1638": "Which is the best book genre? Dystopian, fantasy, chick lit, or family and relationships?", "1639": "If you could travel anywhere in the world, where would you go?", "1640": "If you had your restaurant, what food would you serve?", "1641": "What is one food you would never want to try?", "1642": "What was the worst part of your day today?", "1643": "Whats your favorite birthday meal?", "1644": "Whats your favorite TikTok trend?", "1645": "Who is the best talk show host?", "1646": "Are rich people friendly people?", "1647": "Are there any animals that scare you? Which one(s)? How come?", "1648": "Are there any new kids at school? Have you spoken to them?", "1649": "Are there any TV shows you like to watch with your family?", "1650": "Are there parts of your body that you like or dislike? How does my perception of myself impact your perception of yourself?", "1651": "Are there topics your school doesnt teach you about that you should know?", "1652": "Are you an organ donor? Why or why not?", "1653": "Are you close with any of your neighbors?", "1654": "Are you more of a cat person or a dog person?", "1655": "Are you registered to vote? Why or why not?", "1656": "Are you worried about the future? Like going to college or getting a job?", "1657": "Can you guess the ingredients in the food we ate?", "1658": "Can you tell me about your P.E. class today?", "1659": "Coffee or tea?", "1660": "Describe the best day ever.", "1661": "Describe your perfect day.", "1662": "Describe yourself in 3 words.", "1663": "Did anyone hurt your feelings or make you feel sad today? Tell me about it.", "1664": "Do the ends ever justify the means?", "1665": "Do you and your family have any cool traditions?", "1666": "Do you believe in an afterlife?", "1667": "Do you collect anything? If so, what do you collect?", "1668": "Do you enjoy acting?", "1669": "Do you enjoy learning new languages?", "1670": "Do you enjoy singing?", "1671": "Do you enjoy writing?", "1672": "Do you ever feel jealous of any of your friends? What makes you feel jealous?", "1673": "Do you ever feel left out at school?", "1674": "Do you favor the mountains or the beach?", "1675": "Do you feel Im more or less strict than your friends parents?", "1676": "Do you feel like Im ever critical of your appearance? What do you do when you feel criticized by me?", "1677": "Do you feel you have too much to handle, or are you managing your time well?", "1678": "Do you have any cool talents or skills?", "1679": "Do you have any enemies?", "1680": "Do you have any friends you are worried about right now?", "1681": "Do you have any pets? If so, what kind?", "1682": "Do you have any talents you would want to pursue?", "1683": "Do you have plans yet for tonight? Want to do something fun together?", "1684": "Do you have trouble falling asleep?", "1685": "Do you like going to school events like football games? Why or why not?", "1686": "Do you like to cook? If so, what do you like to cook?", "1687": "Do you like to dance?", "1688": "Do you like to exercise?", "1689": "Do you like to make art?", "1690": "Do you like to play video games?", "1691": "Do you play any instruments? If so, which one(s)?", "1692": "Do you play any sports? If so, which one(s)?", "1693": "Do you prefer the city or the country?", "1694": "Do you prefer to take pictures or be in the picture?", "1695": "Do you take any language classes at school?", "1696": "Do you think its more important: to make a lot of money or to be happy at work?", "1697": "Do you think people should have a second chance when theyve done something wrong?", "1698": "Do you think teens have it harder or more accessible today than when I was a teen?", "1699": "Do you think theres an art point? If so, why does art matter?", "1700": "Do you think you want to continue playing sports after school is over?", "1701": "Do you volunteer anywhere?", "1702": "For a class project, what group of people would you include?", "1703": "Have you ever been out of the country? If so, where?", "1704": "Have you ever been to a concert?", "1705": "Have you ever grown out of a friendship that you now miss?", "1706": "Have you ever moved?", "1707": "Have you ever sent a text message to the wrong person? What did you do?", "1708": "Have you had any close games/matches/meets this year?", "1709": "Have you had any hard tests lately?", "1710": "Have you lived here (the area where you live) your whole life?", "1711": "Have you worked your first job yet? If so, where?", "1712": "How do you deal with drama at school?", "1713": "How do you get to school?", "1714": "How do you handle bullying at school?", "1715": "How do you like to spend your weekends?", "1716": "How do you respond when your friends have drugs?", "1717": "How do your friends talk about mental health? How do you feel talking about mental health?", "1718": "How long have you been playing that instrument?", "1719": "How long have you been playing that sport?", "1720": "How many colors are in a rainbow?", "1721": "If you can replace one colour in a rainbow, what would that be, with what colour and why?", "1722": "How would you describe your style? Do you feel like other teens are accepting of your class or critical?", "1723": "If plants could talk, what would they be like?", "1724": "If rain could be another liquid, what liquid would you make it?", "1725": "If snow could have a flavor, what would you choose?", "1726": "If someone gave you $20, what would you do with it?", "1727": "If someone hurts your feelings at school, how do you deal with it?", "1728": "If you became Instagram famous, what would be your persona (fitness guru, funny memes, makeup tutorials, inspirational calligraphy quotes, etc.)?", "1729": "If you could be a walrus or a porcupine for one day, which would you choose, and why?", "1730": "If you could celebrate one holiday every month, which one would you choose?", "1731": "If you could change one thing about your school, what would it be?", "1732": "If you could change one thing in the world, what would it be?", "1733": "If you could change one thingabout the world, what would it be?", "1734": "If you could change the color of the sky, what color would you choose?", "1735": "If you could communicate with one type of animal, which would you choose?", "1736": "If you could decorate the whole town with one color of Christmas lights, what color would you choose? Who would you ask to help you decorate the city?", "1737": "If you could go serve somewhere this summer, where would you go?", "1738": "If you could go to another planet, which planet would you pick? What would you take with you?", "1739": "If you could have a class pet, what would it be?", "1740": "If you could make a movie about your school, who would be the star(s) and what would be the title?", "1741": "If you could make everyone in the world smile, how would you do it?", "1742": "If you could make up a holiday, what would it be?", "1743": "If you could only choose to have water or electricity, what would you choose? How come?", "1744": "If you could pack anything in your lunch, what would you pack?", "1745": "If you could pick your own team for X sport or club, who would be on it?", "1746": "If you could plan a field trip anywhere, where would it be?", "1747": "If you could redo the day, what would you do differently?", "1748": "If you could swap places with one of your parents for a day, what would you do for the day?", "1749": "If you could trade places with someone for a day, who would it be and why?", "1750": "If you could travel back to any decade, what would it be and why?", "1751": "If you could write a book, what would happen to your main character?", "1752": "If you had a pet giraffe, what would you name it?", "1753": "If you had a secret room in your house, what would you keep there?", "1754": "If you were a pair of shoes, what kind would you be?", "1755": "If you were a pirate, what would you do?", "1756": "If you were a tiny mouse, would you be like Stuart Little or Desperaux?", "1757": "If you were in the circus, what would your act be?", "1758": "If your crush had food in their teeth, would you tell them?", "1759": "Is there a cause you feel very drawn to? Why?", "1760": "Is there a teacher that needs a note of encouragement?", "1761": "Is there any bullying going on at school?", "1762": "Is there anything about you that you wish could change? What makes you feel that way?", "1763": "Is there anything you are looking forward to right now?", "1764": "Is there anything you were worried about today?", "1765": "Is Ursula a villain, or did Ariel just not read the contract?", "1766": "Make a silly song that starts with, I have a little nose.", "1767": "Make up a story that includes a pair of gloves, a fork, and a football.", "1768": "Tell me a story about something that happened to you.", "1769": "Tell me about the most extraordinary person youve ever met.", "1770": "Tell me more about the clubs youre in at school and what you do at them.", "1771": "Tell me your funniest joke.", "1772": "What advice would you give elementary school students about to move to middle school?", "1773": "What animal do you think makes the best pet?", "1774": "What animal makes you giggle? Show me pics/videos!", "1775": "What app would you create to make high schoolers lives easier?", "1776": "What are mom and dads favorite things?", "1777": "What are three things youre grateful for in life?", "1778": "What are you worried or stressed about right now?", "1779": "What are your favorite kinds of books to read?", "1780": "What are your grades like?", "1781": "What are your pets names?", "1782": "What bands are you listening to lately? Can we listen to your favorite song? What do you like about this song?", "1783": "What classes are you taking right now?", "1784": "What colleges would you like to visit?", "1785": "What country do you want to visit?", "1786": "What crime would you be arrested for?", "1787": "What do people do between classes?", "1788": "What do you do with your allowance?", "1789": "What do you dream of doing when youre older? Is there anything you can do now to help you accomplish that goal?", "1790": "What do you eat for lunch at school?", "1791": "What do you feel like other people judge you for?", "1792": "What do you love about your teachers?", "1793": "What do you need right now that you dont have?", "1794": "What do you think a rich person looks like?", "1795": "What do you think is most important when it comes to dating?", "1796": "What do you think it means to be a good global citizen?", "1797": "What do you think should be changed about the education system?", "1798": "What do you think you want to study in college/university?", "1799": "What do you want to be when you grow up? How come?", "1800": "What do you wish you could talk to me about? What makes it hard to talk about it?", "1801": "What do your parents do for a living?", "1802": "What does my generation not understand about your generation?", "1803": "What emoji describes your day?", "1804": "What fictional place would you like to visit?", "1805": "What happens during a day at work?", "1806": "What have you learned about yourself in the last year?", "1807": "What holiday has the best school activities?", "1808": "What holiday memory makes you feel happy?", "1809": "What inspires you?", "1810": "What is everybody talking about right now?", "1811": "What is something hard for you to share?", "1812": "What is something you wish adults understood about middle school kids?", "1813": "What is the best holiday cookie?", "1814": "What is the funniest holiday movie?", "1815": "What is the funniest-looking animal? What is the cutest animal?", "1816": "What is the grossest food they serve in the cafeteria? Does anyone eat it?", "1817": "What is the hardest thing to do?", "1818": "What is the most annoying word?", "1819": "What is the most challenging job?", "1820": "What is the most embarrassing thing I do?", "1821": "What is the nicest thing youve done for a friend?", "1822": "What is the strangest thing that grown-ups do?", "1823": "What is your favorite and least favorite class?", "1824": "What is your favorite animal to draw?", "1825": "What is your favorite book with animals?", "1826": "What is your favorite game or exercise to do in PE?", "1827": "What is your favorite Hannukah tradition?", "1828": "What is your favorite historical event youve learned about?", "1829": "What is your favorite holiday?", "1830": "What is your favorite Kwanzaa food?", "1831": "What is your favorite movie with animals in it?", "1832": "What is your favorite restaurant?", "1833": "What is your school mascot?", "1834": "What kind of music do you listen to?", "1835": "What kinds of art projects do you enjoy?", "1836": "What kinds of lunches do they serve you at school?", "1837": "What kinds of things do you like to write?", "1838": "What language would you like to learn? Why?", "1839": "What made your teacher laugh/smile today?", "1840": "What makes a good friend? Do you feel like you have any friends like that?", "1841": "What makes a person successful?", "1842": "What makes you angry?", "1843": "What makes you unique?", "1844": "What music is popular right now?", "1845": "What nicknames would you give everyone in the family?", "1846": "What other states have you been to in your country?", "1847": "What political party will you join when you can vote? Why? Is there anything you disagree with in the political party even though youd vote for them?", "1848": "What song has been on repeat for you lately?", "1849": "What subject do you feel like youre growing in?", "1850": "What takes only a little space in your life but means a lot to you?", "1851": "What teacher do you like best this year? What do you like about them and their teaching style?", "1852": "What teacher drives you crazy? What do they do that you dislike? How could they be a better teacher?", "1853": "What trend do I think is cool, but do you think its tacky?", "1854": "What video game console do you like to use?", "1855": "What was the best present given to you?", "1856": "What was the funniest thing a teacher said today?", "1857": "What world problem would you like to help solve?", "1858": "What would make the world a better place?", "1859": "What would you do if you could fly?", "1860": "What would you do if you had 4 arms?", "1861": "What would you do with $100?", "1862": "What yarn should I get for you? (If your Gen Z teen is one of many who loves knitting!)", "1863": "Whats an accomplishment that you are proud of?", "1864": "Whats been your favorite year of life so far, and why?", "1865": "Whats on your mind right now?", "1866": "Whats one thing you would change about the world if you could?", "1867": "Whats something you want to learn how to do?", "1868": "Whats something you wish you knew?", "1869": "Whats the best youve played this year? Tell me about it.", "1870": "Whats the craziest dream youve ever had?", "1871": "Whats the difference between love and lust?", "1872": "Whats the difference between playing alone and playing with your friends?", "1873": "Whats the strangest food youve ever eaten?", "1874": "Whats the strangest thing youre afraid of?", "1875": "Whats the weirdest thing you find attractive in a person?", "1876": "Whats your dream job?", "1877": "Whats your favorite band?", "1878": "Whats your favorite book youve read so far?", "1879": "Whats your favorite holiday craft?", "1880": "Whats your favorite holiday memory?", "1881": "Whats your favorite holiday?", "1882": "Whats your favorite mealtime? Breakfast, lunch, or dinner?", "1883": "Whats your favorite memory from childhood?", "1884": "Whats your favorite movie?", "1885": "Whats your favorite outfit?", "1886": "Whats your favorite part of playing the sport you play?", "1887": "Whats your favorite part of the day?", "1888": "Whats your favorite part of the school day?", "1889": "Whats your favorite place that weve gone to on vacation? What was it like?", "1890": "Whats your favorite season?", "1891": "Whats your favorite show right now? Who do you identify with in the show? Do you have a crush on any of the characters?", "1892": "Whats your favorite thing about where we live?", "1893": "Whats your favorite thing to cook?", "1894": "Whats your favorite video game to play?", "1895": "Whats your favorite way to spend time outdoors?", "1896": "Whats your favorite winter scent?", "1897": "When do you feel the most loved?", "1898": "Where do you like to hangout? Tell me about it.", "1899": "Where does your family like to go on vacation?", "1900": "Where would you like to travel to if you could?", "1901": "Wheres your favorite place to relax?", "1902": "Which holiday song is the best?", "1903": "Which is betterbooks about dinosaurs or horses?", "1904": "Which is bettersquishy toys or toys with wheels? How come?", "1905": "Which subject do you think would be the most fun to teach?", "1906": "Who are your closest friends at school?", "1907": "Who could you be nicer to?", "1908": "Who did you sit next to at lunch?", "1909": "Who do you eat lunch with at school?", "1910": "Who do you think needs a friend at school?", "1911": "Who does X (lonely kid, shy kid, etc.) sit next to at lunch?", "1912": "Who has the best locker decorations?", "1913": "Who is the best musician at school?", "1914": "Who is the best? Easter Bunny, Santa Claus, Frosty the Snowman, or Cupid?", "1915": "Who is your closest friend at school?", "1916": "Who is your favorite actor/actress? Why?", "1917": "Who is your favorite person at school? How come?", "1918": "Who makes you laugh? What do they do that makes you laugh?", "1919": "Who would be more like to win at rock, paper, scissors? An elephant, a cat, or a monkey?", "1920": "Why do you think people like to have fish as pets when you cant hug or play with them?", "1921": "Why do you think people prefer cats or dogs?", "1922": "Would I be surprised to see how you interact with people at school? Do you feel you have more freedom to be yourself with your friends?", "1923": "Would you ever consider being a vegetarian? Why or why not?", "1924": "Would you ever enlist in the military? Why or why not?", "1925": "Would you ever want a praying mantis as a pet? What would you name it? What do you think the praying mantis is praying about?", "1926": "Would you instead fall over in gym class or trip and fall in the cafeteria?", "1927": "Would you pretend you didnt know me if my face looked like a hamsters?", "1928": "Would you rather be friends with a unicorn or a mermaid?", "1929": "Would you rather be green like the leaves on a tree or blue like the ocean?", "1930": "Would you rather carve a jack-o-lantern or decorate Valentines cards?", "1931": "Would you rather celebrate your birthday or your friends birthday? What was the best birthday food youve ever eaten?", "1932": "Would you rather have a tail or fur?", "1933": "Would you rather hop like a kangaroo or run like an ostrich?", "1934": "Would you rather live in a box with a litter of cats or live in a tree stump with a badger?", "1935": "Would you rather live under the ocean or in the sky?", "1936": "Would you rather ride on the back of a llama or a tiger?", "1937": "Would you rather spend the night on the beach in a Santa costume or sing a solo in the mall wearing a onesie?", "1938": "Would you rather talk like SpongeBob, Patrick, or Squidward?", "1939": "Are there a lot of people dating in school?", "1940": "Are you a part of any clubs at school? If so, what are they?", "1941": "Are you more of a sweet or salty snack person?", "1942": "Are you planning on going to college?", "1943": "Are you worried about any friends currently? Why is that?", "1944": "Are your parents strict?", "1945": "Did anyone frustrate you today?", "1946": "Did you learn anything about another country?", "1947": "Do you believe in a certain religion? Why or why not?", "1948": "Do you feel safe at school? Why or why not?", "1949": "Do you get along with your siblings well?", "1950": "Do you have a favorite teacher?", "1951": "Do you have any siblings? If so, how many?", "1952": "Do you have anyone youre crushing on right now? Who?", "1953": "Do you have chores at home?", "1954": "Do you have your drivers license?", "1955": "Do you like school?", "1956": "Do you like to watch sports? Which ones?", "1957": "Do you live close to your extended family?", "1958": "Do you take more after your dad or your mom?", "1959": "Do you think its better to be funny or smart? How come?", "1960": "Do you think one day youll want to get married?", "1961": "Have you applied for any summer jobs?", "1962": "Have you ever dated someone before? Tell me about that.", "1963": "Have you had your first kiss yet?", "1964": "Have you heard any funny jokes lately?", "1965": "How long have you been friends with the friend(s) you have?", "1966": "If one ofyourclassmates could be the principal for the day who would you want it to be and why?", "1967": "If you could add anything as an elective class, what would you pick?", "1968": "If you could be any of your teachers, who would you be and why?", "1969": "If you could be the teacher tomorrow, which class would you teach, and what would you do?", "1970": "If you could change one thing about your room, what would you do?", "1971": "If you could invent a subject in school, what would it be?", "1972": "If you could live in a cartoon, what cartoon would you choose? Would you be yourself, or would you want to be one of the characters already in the cartoon?", "1973": "If you could make up a holiday, what would you call it, and what would it celebrate?", "1974": "If you could make your own zoo, what animals would you have there?", "1975": "If you could plan the family vacation, where would we go and what would we do?", "1976": "If you could rename yourself, what name would you choose? How come?", "1977": "If you could start a new club at school, what would it be?", "1978": "If you had to pick, what would your death row meal be?", "1979": "Is there anyone in school that you would like to get to know better? Who?", "1980": "Is there anyone you think you would be friends with if you knew a little bit more about them?", "1981": "Is there something on the playground you want to master that you havent yet?", "1982": "On a scale of 1 to 10, how would you rateyourday? Why?", "1983": "Tell me about one of the happiest days of your life and why it made you so happy.", "1984": "Tell me about some of the things on your bucket list.", "1985": "Tell me about the person youre crushing on. What do you like about them?", "1986": "What are you most afraid of and why?", "1987": "What are you most passionate about?", "1988": "What are your friends like?", "1989": "What area of school do you feel like youre doing the best in?", "1990": "What challenged you today?", "1991": "What colleges or trade schools are you interested in?", "1992": "What current event did you learn about today?", "1993": "What did you learn that was new today?", "1994": "What did you read about today?", "1995": "What do you and your friends like to do together?", "1996": "What do you call your grandparents?", "1997": "What do you hope to learn or accomplish before the end of the school year?", "1998": "What do you like most about your mom/dad/brother/sister?", "1999": "What do you like to do when its raining outside?", "2000": "What do you think about the clothing styles today?", "2001": "What funny videos have you seen on social media lately?", "2002": "What is the best thing to do on a snow day?", "2003": "What is the most interesting assignment youve worked on this year?", "2004": "What is your favorite after school snack?", "2005": "What is your favorite field trip youve gone on?", "2006": "What is your favorite game to play?", "2007": "What is your teachers most important rule?", "2008": "What kind of person do you imagine when you hear the name Bertha? What about the name Amadeus?", "2009": "What kind of work have you been doing in school lately?", "2010": "What makes you feel better when youre upset?", "2011": "What new fact did you learn today?", "2012": "What qualities do you think are good for a girlfriend/boyfriend/partner to have?", "2013": "What qualities make a bad friend?", "2014": "What quote or lyric do you love? Why is it so special to you?", "2015": "What recess equipment is most popular?", "2016": "What restaurant could you not live without?", "2017": "What subject do you dislike the most?", "2018": "What was the high point and low point of your day?", "2019": "What was your favorite thing you did today at school?", "2020": "What would you change about today?", "2021": "What would you like to do once school is over?", "2022": "Whats one of the biggest challenges youve faced so far in life?", "2023": "Whats the hardest part of being a student?", "2024": "Whats the worst thing about being a teenager?", "2025": "Whats your birth order?", "2026": "Whats your favorite class right now? Why?", "2027": "Whats your favorite ice cream flavor?", "2028": "Whats your favorite kind of food?", "2029": "Whats your favorite subject in school?", "2030": "Whats your favorite thing about being a teenager?", "2031": "When would you like to live on your own?", "2032": "Where do you like to shop?", "2033": "Where do you see yourself in 5 years?", "2034": "Which rule was the hardest to follow today?", "2035": "Who are you closest to in your family? Why?", "2036": "Who are your close friends?", "2037": "Who are your favorite sports teams?", "2038": "Who are your role models, and why?", "2039": "Who did you play with at recess?", "2040": "Who is the nicest person you know?", "2041": "Who is your best friend?", "2042": "Who is your celebrity crush?", "2043": "Who would you like to befriend and why?", "2044": "Would you like to have a kid one day?"}